zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cm_jh/pic32cm_jh00/pic32cm2532jh00100-pinctrl.h
/* pb6_gpio */
#define PB6_GPIO MCHP_PINMUX(b, 6, gpio, gpio)

/* pb6a_eic_extint6 */
#define PB6A_EIC_EXTINT6 MCHP_PINMUX(b, 6, a, periph)

/* pb6b_ac_ain7 */
#define PB6B_AC_AIN7 MCHP_PINMUX(b, 6, b, periph)

/* pb6b_adc1_ain8 */
#define PB6B_ADC1_AIN8 MCHP_PINMUX(b, 6, b, periph)

/* pb6b_ptc_y12 */
#define PB6B_PTC_Y12 MCHP_PINMUX(b, 6, b, periph)

/* pb6i_ccl_in6 */
#define PB6I_CCL_IN6 MCHP_PINMUX(b, 6, i, periph)

/* pb6k_ptc_ds12 */
#define PB6K_PTC_DS12 MCHP_PINMUX(b, 6, k, periph)

/* pb7_gpio */
#define PB7_GPIO MCHP_PINMUX(b, 7, gpio, gpio)

/* pb7a_eic_extint7 */
#define PB7A_EIC_EXTINT7 MCHP_PINMUX(b, 7, a, periph)

/* pb7b_adc1_ain9 */
#define PB7B_ADC1_AIN9 MCHP_PINMUX(b, 7, b, periph)

/* pb7b_ptc_y13 */
#define PB7B_PTC_Y13 MCHP_PINMUX(b, 7, b, periph)

/* pb7i_ccl_in7 */
#define PB7I_CCL_IN7 MCHP_PINMUX(b, 7, i, periph)

/* pb7k_ptc_ds13 */
#define PB7K_PTC_DS13 MCHP_PINMUX(b, 7, k, periph)

/* pb8_gpio */
#define PB8_GPIO MCHP_PINMUX(b, 8, gpio, gpio)

/* pb8a_eic_extint8 */
#define PB8A_EIC_EXTINT8 MCHP_PINMUX(b, 8, a, periph)

/* pb8b_adc0_ain2 */
#define PB8B_ADC0_AIN2 MCHP_PINMUX(b, 8, b, periph)

/* pb8b_adc1_ain4 */
#define PB8B_ADC1_AIN4 MCHP_PINMUX(b, 8, b, periph)

/* pb8b_ptc_y14 */
#define PB8B_PTC_Y14 MCHP_PINMUX(b, 8, b, periph)

/* pb8d_sercom4_pad0 */
#define PB8D_SERCOM4_PAD0 MCHP_PINMUX(b, 8, d, periph)

/* pb8e_tc0_wo0 */
#define PB8E_TC0_WO0 MCHP_PINMUX(b, 8, e, periph)

/* pb8i_ccl_in8 */
#define PB8I_CCL_IN8 MCHP_PINMUX(b, 8, i, periph)

/* pb8k_ptc_ds14 */
#define PB8K_PTC_DS14 MCHP_PINMUX(b, 8, k, periph)

/* pb9_gpio */
#define PB9_GPIO MCHP_PINMUX(b, 9, gpio, gpio)

/* pb9a_eic_extint9 */
#define PB9A_EIC_EXTINT9 MCHP_PINMUX(b, 9, a, periph)

/* pb9b_adc0_ain3 */
#define PB9B_ADC0_AIN3 MCHP_PINMUX(b, 9, b, periph)

/* pb9b_adc1_ain5 */
#define PB9B_ADC1_AIN5 MCHP_PINMUX(b, 9, b, periph)

/* pb9b_ptc_y15 */
#define PB9B_PTC_Y15 MCHP_PINMUX(b, 9, b, periph)

/* pb9d_sercom4_pad1 */
#define PB9D_SERCOM4_PAD1 MCHP_PINMUX(b, 9, d, periph)

/* pb9e_tc0_wo1 */
#define PB9E_TC0_WO1 MCHP_PINMUX(b, 9, e, periph)

/* pb9i_ccl_out2 */
#define PB9I_CCL_OUT2 MCHP_PINMUX(b, 9, i, periph)

/* pb9k_ptc_ds15 */
#define PB9K_PTC_DS15 MCHP_PINMUX(b, 9, k, periph)

/* pb10_gpio */
#define PB10_GPIO MCHP_PINMUX(b, 10, gpio, gpio)

/* pb10a_eic_extint10 */
#define PB10A_EIC_EXTINT10 MCHP_PINMUX(b, 10, a, periph)

/* pb10d_sercom4_pad2 */
#define PB10D_SERCOM4_PAD2 MCHP_PINMUX(b, 10, d, periph)

/* pb10e_tc1_wo0 */
#define PB10E_TC1_WO0 MCHP_PINMUX(b, 10, e, periph)

/* pb10f_tcc0_wo4 */
#define PB10F_TCC0_WO4 MCHP_PINMUX(b, 10, f, periph)

/* pb10h_gclk_io4 */
#define PB10H_GCLK_IO4 MCHP_PINMUX(b, 10, h, periph)

/* pb10i_ccl_in5 */
#define PB10I_CCL_IN5 MCHP_PINMUX(b, 10, i, periph)

/* pb11_gpio */
#define PB11_GPIO MCHP_PINMUX(b, 11, gpio, gpio)

/* pb11a_eic_extint11 */
#define PB11A_EIC_EXTINT11 MCHP_PINMUX(b, 11, a, periph)

/* pb11d_sercom4_pad3 */
#define PB11D_SERCOM4_PAD3 MCHP_PINMUX(b, 11, d, periph)

/* pb11e_tc1_wo1 */
#define PB11E_TC1_WO1 MCHP_PINMUX(b, 11, e, periph)

/* pb11f_tcc0_wo5 */
#define PB11F_TCC0_WO5 MCHP_PINMUX(b, 11, f, periph)

/* pb11h_gclk_io5 */
#define PB11H_GCLK_IO5 MCHP_PINMUX(b, 11, h, periph)

/* pb11i_ccl_out1 */
#define PB11I_CCL_OUT1 MCHP_PINMUX(b, 11, i, periph)

/* pb12_gpio */
#define PB12_GPIO MCHP_PINMUX(b, 12, gpio, gpio)

/* pb12a_eic_extint12 */
#define PB12A_EIC_EXTINT12 MCHP_PINMUX(b, 12, a, periph)

/* pb12b_ptc_x12 */
#define PB12B_PTC_X12 MCHP_PINMUX(b, 12, b, periph)

/* pb12b_ptc_y28 */
#define PB12B_PTC_Y28 MCHP_PINMUX(b, 12, b, periph)

/* pb12c_sercom4_pad0 */
#define PB12C_SERCOM4_PAD0 MCHP_PINMUX(b, 12, c, periph)

/* pb12e_tc0_wo0 */
#define PB12E_TC0_WO0 MCHP_PINMUX(b, 12, e, periph)

/* pb12f_tcc0_wo6 */
#define PB12F_TCC0_WO6 MCHP_PINMUX(b, 12, f, periph)

/* pb12h_gclk_io6 */
#define PB12H_GCLK_IO6 MCHP_PINMUX(b, 12, h, periph)

/* pb12k_ptc_ds28 */
#define PB12K_PTC_DS28 MCHP_PINMUX(b, 12, k, periph)

/* pb13_gpio */
#define PB13_GPIO MCHP_PINMUX(b, 13, gpio, gpio)

/* pb13a_eic_extint13 */
#define PB13A_EIC_EXTINT13 MCHP_PINMUX(b, 13, a, periph)

/* pb13b_ptc_x13 */
#define PB13B_PTC_X13 MCHP_PINMUX(b, 13, b, periph)

/* pb13b_ptc_y29 */
#define PB13B_PTC_Y29 MCHP_PINMUX(b, 13, b, periph)

/* pb13c_sercom4_pad1 */
#define PB13C_SERCOM4_PAD1 MCHP_PINMUX(b, 13, c, periph)

/* pb13e_tc0_wo1 */
#define PB13E_TC0_WO1 MCHP_PINMUX(b, 13, e, periph)

/* pb13f_tcc0_wo7 */
#define PB13F_TCC0_WO7 MCHP_PINMUX(b, 13, f, periph)

/* pb13h_gclk_io7 */
#define PB13H_GCLK_IO7 MCHP_PINMUX(b, 13, h, periph)

/* pb13k_ptc_ds29 */
#define PB13K_PTC_DS29 MCHP_PINMUX(b, 13, k, periph)

/* pb14_gpio */
#define PB14_GPIO MCHP_PINMUX(b, 14, gpio, gpio)

/* pb14a_eic_extint14 */
#define PB14A_EIC_EXTINT14 MCHP_PINMUX(b, 14, a, periph)

/* pb14b_ptc_x14 */
#define PB14B_PTC_X14 MCHP_PINMUX(b, 14, b, periph)

/* pb14b_ptc_y30 */
#define PB14B_PTC_Y30 MCHP_PINMUX(b, 14, b, periph)

/* pb14c_sercom4_pad2 */
#define PB14C_SERCOM4_PAD2 MCHP_PINMUX(b, 14, c, periph)

/* pb14e_tc1_wo0 */
#define PB14E_TC1_WO0 MCHP_PINMUX(b, 14, e, periph)

/* pb14f_tc7_wo0 */
#define PB14F_TC7_WO0 MCHP_PINMUX(b, 14, f, periph)

/* pb14h_gclk_io0 */
#define PB14H_GCLK_IO0 MCHP_PINMUX(b, 14, h, periph)

/* pb14i_ccl_in9 */
#define PB14I_CCL_IN9 MCHP_PINMUX(b, 14, i, periph)

/* pb14k_ptc_ds30 */
#define PB14K_PTC_DS30 MCHP_PINMUX(b, 14, k, periph)

/* pb15_gpio */
#define PB15_GPIO MCHP_PINMUX(b, 15, gpio, gpio)

/* pb15a_eic_extint15 */
#define PB15A_EIC_EXTINT15 MCHP_PINMUX(b, 15, a, periph)

/* pb15b_ptc_x15 */
#define PB15B_PTC_X15 MCHP_PINMUX(b, 15, b, periph)

/* pb15b_ptc_y31 */
#define PB15B_PTC_Y31 MCHP_PINMUX(b, 15, b, periph)

/* pb15c_sercom4_pad3 */
#define PB15C_SERCOM4_PAD3 MCHP_PINMUX(b, 15, c, periph)

/* pb15e_tc1_wo1 */
#define PB15E_TC1_WO1 MCHP_PINMUX(b, 15, e, periph)

/* pb15f_tc7_wo1 */
#define PB15F_TC7_WO1 MCHP_PINMUX(b, 15, f, periph)

/* pb15h_gclk_io1 */
#define PB15H_GCLK_IO1 MCHP_PINMUX(b, 15, h, periph)

/* pb15i_ccl_in10 */
#define PB15I_CCL_IN10 MCHP_PINMUX(b, 15, i, periph)

